app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 LIMIT 5 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
  def index
    # @posts = Post.where(user_id:current_user.id)
    @posts1 = current_user.posts
    @posts = @posts1.paginate(:page => params[:page], :per_page => 5)

INSERT INTO "posts" ("titulo", "contenido", "imagen", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["titulo", "Hola"], ["contenido", "Holaaaa"], ["imagen", "222"], ["user_id", 1], ["created_at", "2015-12-15 04:16:07.157263"], ["updated_at", "2015-12-15 04:16:07.157263"]]
---
  def create
    # @post = Post.new(post_params)
    # @post.user_id = current_user.id
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "imagen" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["imagen", "12011196_10205395359465255_3426681731383849022_n.jpg"], ["updated_at", "2015-12-16 04:11:50.694784"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)